# ハーフトーン処理（濃度パターン法）
import numpy as np
import cv2
import sys

fname_in  = sys.argv[1]
fname_out = sys.argv[2]

#画像をロードしてグレースケール化
img = cv2.imread( fname_in )
img = cv2.cvtColor(img, cv2.COLOR_RGB2GRAY)

#出力画像を準備
H = img.shape[0]
W = img.shape[1]
img_out = np.zeros((H,W), np.uint8)

#濃度パターン
pattern = np.array(
	[ [[0,0,0,0], [0,0,0,0], [0,0,0,0], [0,0,0,0]], #0
	  [[1,0,0,0], [0,0,0,0], [0,0,0,0], [0,0,0,0]], #1
	  [[1,0,0,0], [0,0,0,0], [0,0,0,0], [1,0,0,0]], #2
	  [[1,0,0,0], [0,0,0,0], [0,0,0,0], [1,0,1,0]], #3
	  [[1,0,0,0], [0,0,1,0], [0,0,0,0], [1,0,1,0]], #4
	  [[1,0,0,0], [1,0,1,0], [0,0,0,0], [1,0,1,0]], #5
	  [[1,0,0,0], [1,0,1,0], [0,1,0,0], [1,0,1,0]], #6
	  [[1,0,0,1], [1,0,1,0], [0,1,0,0], [1,0,1,0]], #7
	  [[1,0,0,1], [1,0,1,0], [0,1,0,1], [1,0,1,0]], #8
	  [[1,1,0,1], [1,0,1,0], [0,1,0,1], [1,0,1,0]], #9
	  [[1,1,0,1], [1,0,1,0], [0,1,0,1], [1,1,1,0]], #10
	  [[1,1,0,1], [1,0,1,1], [0,1,0,1], [1,1,1,0]], #11
	  [[1,1,0,1], [1,0,1,1], [0,1,0,1], [1,1,1,1]], #12
	  [[1,1,0,1], [1,1,1,1], [0,1,0,1], [1,1,1,1]], #13
	  [[1,1,0,1], [1,1,1,1], [1,1,0,1], [1,1,1,1]], #14
	  [[1,1,1,1], [1,1,1,1], [1,1,0,1], [1,1,1,1]], #15
	  [[1,1,1,1], [1,1,1,1], [1,1,1,1], [1,1,1,1]] ]) #16
pattern *= 255

#ハーフトーン画像を作成計算
#img_outの各ブロックを埋める
for y in range(int(H / 4)) :
    for x in range(int(W / 4)) :
            average = np.mean(img[y*4:(y+1)*4, x*4:(x+1)*4])
            for i in range(17):
                    if(255/17*i) <= average and average < (255/17)*(i+1):
                            img_out[y*4:(y+1)*4,x*4:(x+1)*4] = pattern[i]
if H % 4 != 0:
        for y in range( int(H / 4) * 4, H ) :
                img_out[y,x] = 0                 

if W % 4 != 0:
        for x in range( int(W / 4) * 4, W ) :
                img_out[y,x] = 0          

#出力
cv2.imwrite( fname_out, img_out)